#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_LiufangzheCommon

#include "Basic.hpp"

#include "KuroAnim_structs.hpp"
#include "Engine_structs.hpp"
#include "ELiufangzheWeaponType_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_MonsterCommon_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_LiufangzheCommon.ABP_LiufangzheCommon_C
// 0x5620 (0x84B0 - 0x2E90)
class UABP_LiufangzheCommon_C : public UABP_MonsterCommon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ABP_LiufangzheCommon_C;             // 0x2E88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1_ABP_LiufangzheCommon_C;       // 0x2E90(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_ABP_LiufangzheCommon_C; // 0x2EC8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_ABP_LiufangzheCommon_C; // 0x2EE8(0x0020)()
	struct FAnimNode_Feedback                     AnimGraphNode_Feedback_ABP_LiufangzheCommon_C;     // 0x2F08(0x0268)()
	struct FAnimNode_SightLock                    AnimGraphNode_SightLock_ABP_LiufangzheCommon_C;    // 0x3170(0x01C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_ABP_LiufangzheCommon_C; // 0x3330(0x0138)()
	struct FAnimNode_BoneRotateToLocation         AnimGraphNode_BoneRotateToLocation_ABP_LiufangzheCommon_C; // 0x3468(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root_ABP_LiufangzheCommon_C;         // 0x3590(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x35C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x35F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x3618(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x3640(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x3668(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x3690(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x36B8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x36E8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_67;                   // 0x3720(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_66;                   // 0x37B0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_65;                   // 0x3840(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_64;                   // 0x38D0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_63;                   // 0x3960(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_62;                   // 0x39F0(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_7;                    // 0x3A80(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0x3B30(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3_ABP_LiufangzheCommon_C; // 0x3B68(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0x3B98(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x3BD0(0x0148)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x3D18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x3D40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x3D68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x3D90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x3DB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x3DE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x3E08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x3E30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x3E58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x3E80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x3EA8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_61;                   // 0x3ED0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_60;                   // 0x3F60(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_59;                   // 0x3FF0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x4080(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x4110(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x41A0(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_6;                    // 0x4230(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19;                      // 0x42E0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0x4318(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54;                   // 0x43A8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x4438(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x44C8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0x4558(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0x45E8(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_5;                    // 0x4678(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0x4728(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0x4760(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0x47F0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x4880(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x4910(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x49A0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x4A30(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_4;                    // 0x4AC0(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x4B70(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x4BA8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x4C38(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x4CC8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x4D58(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x4DE8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x4E78(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_3;                    // 0x4F08(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x4FB8(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2_ABP_LiufangzheCommon_C; // 0x4FF0(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x5020(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4_ABP_LiufangzheCommon_C; // 0x5058(0x0148)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x51A0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3_ABP_LiufangzheCommon_C; // 0x5350(0x01B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x5500(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26_ABP_LiufangzheCommon_C; // 0x5528(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25_ABP_LiufangzheCommon_C; // 0x5550(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24_ABP_LiufangzheCommon_C; // 0x5578(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23_ABP_LiufangzheCommon_C; // 0x55A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22_ABP_LiufangzheCommon_C; // 0x55C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21_ABP_LiufangzheCommon_C; // 0x55F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20_ABP_LiufangzheCommon_C; // 0x5618(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19_ABP_LiufangzheCommon_C; // 0x5640(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18_ABP_LiufangzheCommon_C; // 0x5668(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17_ABP_LiufangzheCommon_C; // 0x5690(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16_ABP_LiufangzheCommon_C; // 0x56B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15_ABP_LiufangzheCommon_C; // 0x56E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14_ABP_LiufangzheCommon_C; // 0x5708(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13_ABP_LiufangzheCommon_C; // 0x5730(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12_ABP_LiufangzheCommon_C; // 0x5758(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11_ABP_LiufangzheCommon_C; // 0x5780(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10_ABP_LiufangzheCommon_C; // 0x57A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9_ABP_LiufangzheCommon_C; // 0x57D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8_ABP_LiufangzheCommon_C; // 0x57F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7_ABP_LiufangzheCommon_C; // 0x5820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6_ABP_LiufangzheCommon_C; // 0x5848(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x5870(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x5900(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x5990(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x5A20(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14_ABP_LiufangzheCommon_C; // 0x5AE0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5_ABP_LiufangzheCommon_C; // 0x5B18(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13_ABP_LiufangzheCommon_C; // 0x5B40(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12_ABP_LiufangzheCommon_C; // 0x5B78(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x5BB0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11_ABP_LiufangzheCommon_C; // 0x5C40(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x5C78(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10_ABP_LiufangzheCommon_C; // 0x5D08(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x5D40(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x5DD0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x5E60(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x5EF0(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9_ABP_LiufangzheCommon_C; // 0x5FB0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x5FE8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x6078(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x6108(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x6198(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8_ABP_LiufangzheCommon_C; // 0x6258(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4_ABP_LiufangzheCommon_C; // 0x6290(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x62B8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x6348(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x63D8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x6468(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x64F8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x6588(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x6618(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7_ABP_LiufangzheCommon_C; // 0x66D8(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1_ABP_LiufangzheCommon_C; // 0x6710(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6_ABP_LiufangzheCommon_C; // 0x6740(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3_ABP_LiufangzheCommon_C; // 0x6778(0x0148)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x68C0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x6950(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x69E0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x6A70(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x6B00(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x6B90(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x6C20(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5_ABP_LiufangzheCommon_C; // 0x6CD0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x6D08(0x0090)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x6D98(0x00D8)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive;                 // 0x6E70(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x6EA8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x6F38(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x6FC8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10_ABP_LiufangzheCommon_C; // 0x7058(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9_ABP_LiufangzheCommon_C; // 0x70E8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8_ABP_LiufangzheCommon_C; // 0x7178(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x7208(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4_ABP_LiufangzheCommon_C; // 0x72B8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2_ABP_LiufangzheCommon_C; // 0x72F0(0x0148)()
	uint8                                         Pad_3202[0x8];                                     // 0x7438(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2_ABP_LiufangzheCommon_C; // 0x7440(0x01B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2_ABP_LiufangzheCommon_C;       // 0x75F0(0x0060)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_ABP_LiufangzheCommon_C; // 0x7650(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1_ABP_LiufangzheCommon_C;       // 0x7710(0x0060)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1_ABP_LiufangzheCommon_C; // 0x7770(0x01B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3_ABP_LiufangzheCommon_C; // 0x7920(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2_ABP_LiufangzheCommon_C; // 0x7948(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_ABP_LiufangzheCommon_C;         // 0x7970(0x0060)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7_ABP_LiufangzheCommon_C; // 0x79D0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3_ABP_LiufangzheCommon_C; // 0x7A60(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_ABP_LiufangzheCommon_C; // 0x7A98(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2_ABP_LiufangzheCommon_C; // 0x7AC8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1_ABP_LiufangzheCommon_C; // 0x7B00(0x0148)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1_ABP_LiufangzheCommon_C; // 0x7C48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_ABP_LiufangzheCommon_C; // 0x7C70(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6_ABP_LiufangzheCommon_C; // 0x7C98(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5_ABP_LiufangzheCommon_C; // 0x7D28(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4_ABP_LiufangzheCommon_C; // 0x7DB8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3_ABP_LiufangzheCommon_C; // 0x7E48(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2_ABP_LiufangzheCommon_C; // 0x7ED8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1_ABP_LiufangzheCommon_C; // 0x7F68(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x7FF8(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1_ABP_LiufangzheCommon_C; // 0x80A8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_ABP_LiufangzheCommon_C; // 0x80E0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_ABP_LiufangzheCommon_C;  // 0x8170(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_ABP_LiufangzheCommon_C; // 0x81A8(0x0148)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_ABP_LiufangzheCommon_C; // 0x82F0(0x01B0)()
	bool                                          ___0;                                              // 0x84A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          _kh_0;                                             // 0x84A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          _0;                                                // 0x84A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Five__0;                                           // 0x84A3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ____0;                                             // 0x84A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ELiufangzheWeaponType                         Fh__;                                              // 0x84A5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          A__7;                                              // 0x84A6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          A__s;                                              // 0x84A7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_LiufangzheCommon(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_TransitionResult_52C450844EBF9BFBB8282B9C6B941D1D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_TransitionResult_C823D0574DC7BFFD1486B185FB74217D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_TransitionResult_8E52222C4F7CCA4D8A2BD6955D653104();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_BlendListByInt_0E3C99E146C38005332675958239B31D();
