#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Nanzhu_SP

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Nanzhu_SP.GA_Nanzhu_SP_C.ExecuteUbergraph_GA_Nanzhu_SP
// 0x0320 (0x0320 - 0x0000)
struct GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemCountByConfigId_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3880[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3881[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3882[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0068(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3883[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________2;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3884[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00C0(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA______________;                     // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F8(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________3;                              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3885[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0140(0x0028)(ZeroConstructor)
	float                                         CallFunc__________SpeedRatio;                      // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3886[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0178(0x0028)(ZeroConstructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3887[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio_1;                    // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3888[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________2;                          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3889[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388A[0x3];                                     // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________7;                              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388B[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388C[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0220(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA_______________1;                   // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0268(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________8;                              // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388D[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x02A0(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________9;                              // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388E[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________10;                             // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x02E0(0x0028)(ZeroConstructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388F[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________11;                             // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________3;                          // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP) == 0x000008, "Wrong alignment on GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP");
static_assert(sizeof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP) == 0x000320, "Wrong size on GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, EntryPoint) == 0x000000, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_GetItemCountByConfigId_ReturnValue) == 0x000004, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_GetItemCountByConfigId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc__________) == 0x000038, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc___________1) == 0x000040, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc______________) == 0x000048, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000050, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, K2Node_DynamicCast_AsTs_Base_Character) == 0x000058, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000090, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc___________2) == 0x000098, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_GetDisplayName_ReturnValue) == 0x0000A0, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_GetObjectClass_ReturnValue) == 0x0000B0, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0000B8, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C0, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_____GA______________) == 0x0000E8, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F8, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_Conv_NameToString_ReturnValue) == 0x000120, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc___________3) == 0x000130, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, K2Node_CreateDelegate_OutputDelegate_4) == 0x000140, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc__________SpeedRatio) == 0x000168, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000170, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, K2Node_CreateDelegate_OutputDelegate_5) == 0x000178, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_IsValid_ReturnValue_1) == 0x0001A0, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc__________SpeedRatio_1) == 0x0001A4, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc__________SpeedRatio_1' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc___________4) == 0x0001A8, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_______________1) == 0x0001B0, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc___________5) == 0x0001B8, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc___________6) == 0x0001C0, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_______________2) == 0x0001C8, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_______________2' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x0001D0, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x0001D8, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, K2Node_DynamicCast_bSuccess_1) == 0x0001E0, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0001E4, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc___________7) == 0x0001E8, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x0001F0, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_GetDisplayName_ReturnValue_1) == 0x0001F8, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_IsValid_ReturnValue_2) == 0x000208, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_GetObjectClass_ReturnValue_1) == 0x000210, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000218, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, K2Node_CreateDelegate_OutputDelegate_6) == 0x000220, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_____GA_______________1) == 0x000248, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_____GA_______________1' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000258, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, K2Node_CreateDelegate_OutputDelegate_7) == 0x000268, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc___________8) == 0x000290, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_IsValid_ReturnValue_3) == 0x000298, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, K2Node_CreateDelegate_OutputDelegate_8) == 0x0002A0, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc___________9) == 0x0002C8, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_IsValid_ReturnValue_4) == 0x0002D0, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc___________10) == 0x0002D8, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc___________10' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, K2Node_CreateDelegate_OutputDelegate_9) == 0x0002E0, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_IsValid_ReturnValue_5) == 0x000308, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc___________11) == 0x000310, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc___________11' has a wrong offset!");
static_assert(offsetof(GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP, CallFunc_______________3) == 0x000318, "Member 'GA_Nanzhu_SP_C_ExecuteUbergraph_GA_Nanzhu_SP::CallFunc_______________3' has a wrong offset!");

}

